In [3]:
"""Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series."""

import pandas as pd
data_series = pd.Series([4, 8, 15, 16, 23, 42])
print(data_series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
"""Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it."""

import pandas as pd
variable_list = ["Name","ayan","arshad","khan","age","20","abcd","college","IITM","undergraduation","Bye"]
variable_series = pd.Series(variable_list)
print(variable_series)

0                Name
1                ayan
2              arshad
3                khan
4                 age
5                  20
6                abcd
7             college
8                IITM
9     undergraduation
10                Bye
dtype: object

In [16]:
"""Q3. Create a Pandas DataFrame that contains the following data:
*Data*
Then, print the DataFrame."""

import pandas as pd
df = pd.DataFrame()
df['Name'] = ['Alice','Bob','Claire']
df['Age']=[25,30,27]
df['Gender']=['Female','Male','Female']
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [25]:
"""Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example."""

"In simple words, DataFrame is a table containing Data "
"Whereas Series is a list of data"
df[['Name','Age']] # example of dataframe

     Name  Age
0   Alice   25
1     Bob   30
2  Claire   27

In [28]:
df['Name'] #example of series

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [31]:
"""Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?"""
df.head(2) # use to get first 2 rows of data

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

In [ ]:
"""Q6. Which of the following is mutable in nature Series, DataFrame, Panel?"""
# DataFrame, Panel are mutable
# Series objects are value mutable but size immutable

In [41]:
"""Q7. Create a DataFrame using multiple Series. Explain with an example."""
series_1 = ['Ayan','Arshad','Khan']
series_2 = [12,13,14]

df1 = pd.DataFrame()

df1['Name'] = series_1
df1['Numbers'] = series_2
df1

     Name  Numbers
0    Ayan       12
1  Arshad       13
2    Khan       14